{
  "backend/main.mo": "Main Motoko canister defining authorization, blob storage mixins, user and artist profiles, lyrics, voice notes, snippets, and messaging with CRUD-style query and update methods.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend files describing their purpose, structure, and interactions.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens, light/dark theme variables, and global body styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, global layout, theme provider, routes for all pages, and triggers profile setup modal after authentication.",
  "frontend/src/components/auth/AuthButton.tsx": "Login/logout button using Internet Identity with loading states and react-query cache clearing on logout.",
  "frontend/src/components/auth/AuthGate.tsx": "Gate component that blocks access for unauthenticated users and shows a sign-in prompt unless a custom fallback is provided.",
  "frontend/src/components/layout/MobileShell.tsx": "Mobile-first layout with sticky header, bottom navigation, and active-route highlighting wrapped around page content.",
  "frontend/src/components/profile/ProfileForm.tsx": "React form for editing a user profile, managing fields like display name, bio, genres, and social links, and submitting the formatted profile object.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for initial profile creation that collects display name and bio, then saves the profile using a mutation hook.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for handling Internet Identity login, stored identities, and authentication state management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, artist profiles, lyrics, and related data via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and utility classes for global styling.",
  "frontend/src/lib/rhyme/rhymeEngine.ts": "Simple rhyme suggestion function that matches words by shared endings using a predefined word list.",
  "frontend/src/lib/rhyme/wordlist.en.ts": "Static list of common English words used for rhyme matching in the rhyme engine.",
  "frontend/src/lib/templates/songTemplates.ts": "Defines a SongTemplate interface and exports preset song structure templates for use in the lyric editor.",
  "frontend/src/main.tsx": "Initializes React app root and wraps it with React Query and Internet Identity providers.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays an artist’s profile, genres, social links, and message button using fetched profile and snippet data.",
  "frontend/src/pages/ConversationPage.tsx": "Handles viewing and sending messages in a conversation thread, including local history storage and auto‑scrolling.",
  "frontend/src/pages/DiscoveryPage.tsx": "Shows a placeholder discovery page with search input and a coming‑soon message for artist browsing.",
  "frontend/src/pages/InboxPage.tsx": "Lists recent conversations saved in local storage and links to message threads, or shows an empty state.",
  "frontend/src/pages/LyricEditorPage.tsx": "Provides a full lyric editor with saving, updating, deleting, tagging, templates, and rhyme suggestions.",
  "frontend/src/pages/LyricsLibraryPage.tsx": "Displays the user’s saved lyrics with search filtering, metadata, and navigation to individual lyric editing pages.",
  "frontend/src/pages/MyProfilePage.tsx": "Profile page enabling artists to view and edit profile data and upload audio snippets with metadata and progress tracking.",
  "frontend/src/pages/VoiceNotesPage.tsx": "Voice note recording page supporting in-browser audio capture, playback, naming, and saving voice notes.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings for the app theme.",
  "project_state.json": "Project state file describing app vision, features, architecture notes, and image requirements."
}