{
  "backend/main.mo": "Motoko canister implementing authorization, blob storage mixins, and CRUD for user profiles, artist profiles, lyrics, voice notes, song snippets, and conversations.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their roles in routing, UI, hooks, and feature pages.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light/dark themes and global layout tokens.",
  "frontend/index.html": "Main HTML entry enabling PWA features with manifest, meta tags, and root mount for the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, start URL, and required icon assets.",
  "frontend/src/App.tsx": "Primary React app setup configuring TanStack Router routes, theme provider, and profile setup flow.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button handling Internet Identity login/logout with query cache clearing.",
  "frontend/src/components/auth/AuthGate.tsx": "Wrapper component restricting access to authenticated users and showing a sign‑in prompt otherwise.",
  "frontend/src/components/layout/MobileShell.tsx": "Mobile layout wrapper with header, content area, and bottom navigation that highlights active routes.",
  "frontend/src/components/profile/ProfileForm.tsx": "Editable artist profile form supporting name, bio, genres, and social links with add/remove genre logic.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for initial artist profile creation with display name and optional bio submission.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for loading and mutating user profiles, artist profiles, lyrics, and related data via the actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light/dark themes and utility classes.",
  "frontend/src/lib/rhyme/rhymeEngine.ts": "Generates rhyme suggestions for a word by matching common word endings.",
  "frontend/src/lib/rhyme/wordlist.en.ts": "Exports a large array of common English rhyming words used for rhyme generation.",
  "frontend/src/lib/templates/songTemplates.ts": "Defines several song structure templates with names, descriptions, and formatted section layouts.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays an artist’s profile with bio, genres, social links, and their song snippets, with navigation and messaging options.",
  "frontend/src/pages/ConversationPage.tsx": "Shows a messaging interface for a conversation, loads messages, sends new ones, and tracks recent conversations.",
  "frontend/src/pages/DiscoveryPage.tsx": "Provides a search bar and placeholder UI for future artist discovery functionality.",
  "frontend/src/pages/HelpInstallPage.tsx": "Offers step‑by‑step installation instructions for iOS and Android along with visual aids.",
  "frontend/src/pages/InboxPage.tsx": "Displays recent conversations from local storage and links to message threads or a no‑messages state.",
  "frontend/src/pages/LyricEditorPage.tsx": "Provides a lyric editor with create, update, delete, tagging, template insertion, and rhyme suggestions.",
  "frontend/src/pages/LyricsLibraryPage.tsx": "Displays a searchable list of user lyrics with tags and updated dates, and enables creating new lyrics.",
  "frontend/src/pages/MyProfilePage.tsx": "Manages artist profile editing and uploading audio song snippets with metadata and progress tracking.",
  "frontend/src/pages/VoiceNotesPage.tsx": "Allows recording, previewing, and saving short voice notes as audio blobs tied to user accounts.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, writing, persisting, and clearing URL and session parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, custom theme extensions, animations, and plugin usage.",
  "project_state.json": "Project metadata describing app vision, architecture notes, required images, and a list of existing feature definitions with versions."
}