{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Allow audio uploads when MIME type is missing by validating via extension",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Relax Song Snippet audio validation to allow uploads when browser MIME type is missing/unreliable by falling back to filename extension checks while still rejecting clearly non-audio files, and broaden the file picker accept filter for common audio formats.",
      "acceptanceCriteria": [
        "In `frontend/src/pages/MyProfilePage.tsx`, selecting an audio file with a missing/empty `file.type` no longer triggers the 'Please select an audio file' error if the filename extension indicates an audio format.",
        "The upload dialog file picker is configured to allow broad audio selection (not limited by browsers that only filter by MIME type), and users can pick common audio extensions such as .mp3, .wav, .m4a, .aac, .ogg, .flac, .webm.",
        "Clearly non-audio files (e.g., .png, .pdf) are rejected with an English error message.",
        "Uploading a newly-accepted audio file results in a successful call to `publishSongSnippet` and the snippet appears in the list with a playable `<audio>` control."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/audioFileValidation.ts",
          "operation": "create",
          "description": "Add shared helpers to determine whether a selected File should be treated as an audio file, using a safe allowlist of common audio filename extensions as a fallback when `file.type` is empty/unreliable, and returning a human-readable English rejection reason for clearly non-audio selections."
        },
        {
          "path": "frontend/src/pages/MyProfilePage.tsx",
          "operation": "modify",
          "description": "Update the Upload Snippet flow to (1) configure the file input `accept` attribute to include a broad audio filter plus explicit extensions (.mp3,.wav,.m4a,.aac,.ogg,.flac,.webm) to improve picker behavior across browsers, (2) validate selected files using the new audio validation helper so files with empty/non-audio MIME types can still be accepted when the extension indicates audio while clearly non-audio extensions are rejected with an English error message, and (3) continue uploading via the blob-storage `ExternalBlob` (bytes + optional progress) and calling `publishSongSnippet` so the uploaded snippet renders in the list with the existing playable `<audio>` control. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}